UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_ОбновлениеЦен_ПодборНоменклатуры/рар_мп_ОбновлениеЦен_ПодборНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рар_мп_ОбновлениеЦен_ПодборНоменклатуры</name>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Аккаунт</name>
      <type>
        <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>IDТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDРазмера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозможностьСменыЦенДляРазмеров</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Баракод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SKUТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыбранныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>IDТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDРазмера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозможностьСменыЦенДляРазмеров</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Баракод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SKUТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Ozon_СопоставленныеТовары/рар_мп_Ozon_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Ozon_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_ЯндексМаркет_СопоставленныеТовары/рар_мп_ЯндексМаркет_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_ЯндексМаркет_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SKUЯндексМаркета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Wildberries_СопоставленныеТовары/рар_мп_Wildberries_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Wildberries_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDРазмера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьСменыЦенДляРазмеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Баракод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_ОбновлениеЦен_ПодборНоменклатуры/Forms/ФормаПодбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Аккаунт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Аккаунт, "Маркетплейс");
	
	ОбработатьВидимость(Аккаунт);
	
	Запрос = Новый Запрос; 
	
	Если Аккаунт = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_Ozon_СопоставленныеТовары.Аккаунт КАК Аккаунт,
		|	рар_мп_Ozon_СопоставленныеТовары.Артикул КАК Артикул,
		|	СТРОКА(рар_мп_Ozon_СопоставленныеТовары.IDТовара) КАК IDТовара,
		|	СТРОКА(рар_мп_Ozon_СопоставленныеТовары.SKUТовара) КАК SKUТовара,
		|	рар_мп_Ozon_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_Ozon_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_Ozon_СопоставленныеТовары.Упаковка КАК Упаковка,
		|	рар_мп_Ozon_СопоставленныеТовары.НаименованиеТовара КАК НаименованиеТовара
		|ИЗ
		|	РегистрСведений.рар_мп_Ozon_СопоставленныеТовары КАК рар_мп_Ozon_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_Ozon_СопоставленныеТовары.Аккаунт = &Аккаунт"; 
		
	ИначеЕсли Аккаунт = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Аккаунт КАК Аккаунт,
		|	СТРОКА(рар_мп_ЯндексМаркет_СопоставленныеТовары.SKUТовара) КАК SKUТовара,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Артикул КАК Артикул,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Упаковка КАК Упаковка,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.НаименованиеТовара КАК НаименованиеТовара
		|ИЗ
		|	РегистрСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары КАК рар_мп_ЯндексМаркет_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Аккаунт = &Аккаунт"; 
		
	ИначеЕсли Аккаунт = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_Wildberries_СопоставленныеТовары.Аккаунт КАК Аккаунт,
		|	рар_мп_Wildberries_СопоставленныеТовары.Артикул КАК Артикул,
		|	СТРОКА(рар_мп_Wildberries_СопоставленныеТовары.IDТовара) КАК IDТовара,
		|	СТРОКА(рар_мп_Wildberries_СопоставленныеТовары.Баракод) КАК Баракод,
		|	рар_мп_Wildberries_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_Wildberries_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_Wildberries_СопоставленныеТовары.Упаковка КАК Упаковка,
		|	рар_мп_Wildberries_СопоставленныеТовары.Размер КАК Размер,
		|	рар_мп_Wildberries_СопоставленныеТовары.IDРазмера КАК IDРазмера,
		|	рар_мп_Wildberries_СопоставленныеТовары.ВозможностьСменыЦенДляРазмеров КАК ВозможностьСменыЦенДляРазмеров,
		|	рар_мп_Wildberries_СопоставленныеТовары.НаименованиеТовара КАК НаименованиеТовара
		|ИЗ
		|	РегистрСведений.рар_мп_Wildberries_СопоставленныеТовары КАК рар_мп_Wildberries_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_Wildberries_СопоставленныеТовары.Аккаунт = &Аккаунт";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Аккаунт", Параметры.Аккаунт);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		Если Аккаунт = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
			
			Если Не ВыборкаДетальныеЗаписи.ВозможностьСменыЦенДляРазмеров Тогда
				
				НайденныеСтроки = Объект.Номенклатура.НайтиСтроки(Новый Структура("IDТовара", ВыборкаДетальныеЗаписи.IDТовара));
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					
					НоваяСтрока = Объект.Номенклатура.Добавить();
					НоваяСтрока.Номенклатура 					= ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Баракод							= ВыборкаДетальныеЗаписи.Баракод;
					НоваяСтрока.IDТовара 						= ВыборкаДетальныеЗаписи.IDТовара;
					НоваяСтрока.Артикул 						= ВыборкаДетальныеЗаписи.Артикул;
					НоваяСтрока.Упаковка 						= ВыборкаДетальныеЗаписи.Упаковка;
					НоваяСтрока.Характеристика 					= ВыборкаДетальныеЗаписи.Характеристика;
					НоваяСтрока.ВозможностьСменыЦенДляРазмеров 	= ВыборкаДетальныеЗаписи.ВозможностьСменыЦенДляРазмеров;
					
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока = Объект.Номенклатура.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока = Объект.Номенклатура.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры      

#Область ОбработкаКнопкиЗаврешитьПодбор
&НаКлиенте
Процедура ЗаврешитьПодбор(Команда) 
	
  АдресВХ = ЗаврешитьПодборНаСервере();  
  
  ВладелецФормы.ОбработатьПодбор(АдресВХ);
  
  Закрыть();
	
КонецПроцедуры  

&НаСервере
Функция ЗаврешитьПодборНаСервере()
		
  Возврат ПоместитьВоВременноеХранилище(объект.ВыбранныеТовары.Выгрузить());
 
КонецФункции

#КонецОбласти  

#Область ДобавлениеДанныхВТЧВыбранныеТовары

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	МассивВыбранныхСтрок = Элементы.Номенклатура.ВыделенныеСтроки;
	ЗаполнитьТЧВыбранныеТовары(МассивВыбранныхСтрок);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьТЧВыбранныеТовары(МассивВыбранныхСтрок)
	
	Для каждого Строка из МассивВыбранныхСтрок Цикл 
		
		НужныеСтроки = Элементы.Номенклатура.ДанныеСтроки(Строка);
		
		СтруктураВыбранныеТовары = Новый Структура();
		СтруктураВыбранныеТовары.Вставить("Номенклатура", 	НужныеСтроки.Номенклатура);
		СтруктураВыбранныеТовары.Вставить("Упаковка", 		НужныеСтроки.Упаковка);
		СтруктураВыбранныеТовары.Вставить("Характеристика", НужныеСтроки.Характеристика);
		СтруктураВыбранныеТовары.Вставить("Артикул", 		НужныеСтроки.Артикул);
		СтруктураВыбранныеТовары.Вставить("IDТовара", 		НужныеСтроки.IDТовара);
		СтруктураВыбранныеТовары.Вставить("Баракод", 		НужныеСтроки.Баракод);
		СтруктураВыбранныеТовары.Вставить("SKUТовара", 		НужныеСтроки.SKUТовара);
		
		Если Объект.ВыбранныеТовары.НайтиСтроки(СтруктураВыбранныеТовары).Количество() = 0 Тогда
			
			НоваяСтрока                					= Объект.ВыбранныеТовары.Добавить();
			НоваяСтрока.IDТовара       					= Строка(НужныеСтроки.IDТовара);
			НоваяСтрока.Баракод							= НужныеСтроки.Баракод;
			НоваяСтрока.SKUТовара						= НужныеСтроки.SKUТовара;
			НоваяСтрока.Артикул        					= НужныеСтроки.Артикул;
			НоваяСтрока.Упаковка       					= НужныеСтроки.Упаковка;
			НоваяСтрока.Характеристика 					= НужныеСтроки.Характеристика;
			НоваяСтрока.Номенклатура   					= НужныеСтроки.Номенклатура;
			НоваяСтрока.Размер		   					= НужныеСтроки.Размер;
			НоваяСтрока.IDРазмера 						= НужныеСтроки.IDРазмера;
			НоваяСтрока.ВозможностьСменыЦенДляРазмеров 	= НужныеСтроки.ВозможностьСменыЦенДляРазмеров;
			
		КонецЕсли;  
		
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура ВыбранныеТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
		
	МассивВыбранныхСтрок = Элементы.Номенклатура.ВыделенныеСтроки;
	ЗаполнитьТЧВыбранныеТовары(МассивВыбранныхСтрок)
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьВидимость(Маркетплейс)
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураSKUТовара.Видимость			= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураIDТовара.Видимость			= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураРазмер.Видимость 				= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураIDРазмера.Видимость 			= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураБаракод.Видимость 			= Ложь;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыРазмер.Видимость 		= Ложь;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыIDРазмера.Видимость 	= Ложь;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыБаракод.Видимость 		= Ложь;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыSKUТовара.Видимость 	= Истина;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыIDТовара.Видимость 		= Истина;
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураSKUТовара.Видимость			= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураIDТовара.Видимость			= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураРазмер.Видимость 				= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураIDРазмера.Видимость 			= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураБаракод.Видимость 			= Ложь;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыРазмер.Видимость 		= Ложь;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыIDРазмера.Видимость 	= Ложь;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыБаракод.Видимость 		= Ложь;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыSKUТовара.Видимость 	= Истина;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыIDТовара.Видимость 		= Ложь;
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураSKUТовара.Видимость			= Ложь;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураIDТовара.Видимость			= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураРазмер.Видимость 				= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураIDРазмера.Видимость 			= Истина;
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураБаракод.Видимость 			= Истина;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыРазмер.Видимость 		= Истина;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыIDРазмера.Видимость 	= Истина;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыБаракод.Видимость 		= Истина;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыSKUТовара.Видимость 	= Ложь;
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыIDТовара.Видимость 		= Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
